Revit 2024 API
FilterInverseRule Members
The FilterInverseRule type exposes the following members.
Constructors
Name | Description
FilterInverseRule
 Constructs a new instance of FilterInverseRule.
Methods
Name | Description
Dispose |  (Inherited from FilterRule.)
ElementPasses
 Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
 (Inherited from FilterRule.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetInnerRule
 Gets the rule being inverted.
GetRuleParameter
 Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter.
 (Inherited from FilterRule.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetInnerRule
 Gets the rule being inverted.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from FilterRule.)
See Also
FilterInverseRule Class
Autodesk.Revit.DB Namespace